** Circom definition

The Circom code to express the problem can be written as follows
(example 137):
#+begin_src circom
template Multiplier() {
    signal input a ;
    signal input b ;
    signal output c ;
    c <== a*b ;
}
template three_fac () {
    signal input x1 ;
    signal input x2 ;
    signal input x3 ;
    signal output x4 ;
    component mult1 = Multiplier() ;
    component mult2 = Multiplier() ;
    mult1.a <== x1 ;
    mult1.b <== x2 ;
    mult2.a <== mult1.c ;
    mult2.b <== x3 ;
    x4 <== mult2.c ;
}
component main = three_fac() ;
#+end_src

If we save this as ~three_fac.circom~ we can use Circom to generate
the corresponding R1CS by:
#+begin_src sh :exports both
circom three_fac.circom --r1cs --wasm --sym
#+end_src

#+RESULTS:
| [32mtemplate   | instances[0m:    |                             2 |
| non-linear       | constraints:       |                             2 |
| linear           | constraints:       |                             0 |
| public           | inputs:            |                             0 |
| private          | inputs:            |                             3 |
| public           | outputs:           |                             1 |
| wires:           | 6                  |                               |
| labels:          | 11                 |                               |
| [32mWritten    | successfully:[0m |              ./three_fac.r1cs |
| [32mWritten    | successfully:[0m |               ./three_fac.sym |
| [32mWritten    | successfully:[0m | ./three_fac_js/three_fac.wasm |
| [32mEverything | went               |                     okay[0m |

This produces 3 output files, a ~.r1cs~ file and a ~.sym~
file. Importantly, it also generates a new directory (in our case
called ~three_fac_js~, which contains a ~.wasm~ WebAssembly binary, as
well as 2 JavaScript source files. ~generate_witness.js~ will later be
used to generate a ~.wtns~ file from some inputs used in the proof and
~witness_calculator.js~ containing most of the actual logic.

Using SnarkJS we can print information about the R1CS file:
#+begin_src sh :results drawer :exports both
snarkjs r1cs info groth16_files/three_fac.r1cs
#+end_src

#+RESULTS:
:results:
[32;22m[INFO]  [39;1msnarkJS[0m: Curve: bn-128
[32;22m[INFO]  [39;1msnarkJS[0m: # of Wires: 6
[32;22m[INFO]  [39;1msnarkJS[0m: # of Constraints: 2
[32;22m[INFO]  [39;1msnarkJS[0m: # of Private Inputs: 3
[32;22m[INFO]  [39;1msnarkJS[0m: # of Public Inputs: 0
[32;22m[INFO]  [39;1msnarkJS[0m: # of Labels: 11
[32;22m[INFO]  [39;1msnarkJS[0m: # of Outputs: 1
:end:

where we see the number of produced wires the corresponding algebraic
circuit has, the number of constraints in the R1CS as well as the
private and public inputs.

